eisup_2019_docmng_integration/src/Reports/УнифицированнаяФормаМХ19/УнифицированнаяФормаМХ19.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>УнифицированнаяФормаМХ19</name>
  <comment>(Регл)</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>КонДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

eisup_2019_docmng_integration/src/AccumulationRegisters/ПартииТоваровНаСкладахБухгалтерскийУчет/ПартииТоваровНаСкладахБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПартииТоваровНаСкладахБухгалтерскийУчет</name>
  <comment>(Регл)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КорСчет</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Регламентный документ, сформировавший движения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийПартииТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвиженияПериод</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиСписанныхТоваров</name>
    <comment>Индекс строки списанных товаров</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОприходования</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.ВозвратМатериаловИзЭксплуатации</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.ПоступлениеТоваровИзПереработки</types>
      <types>DocumentRef.ОприходованиеМатериаловИзПроизводства</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Reports/УнифицированнаяФормаМХ19/ObjectModule.bsl
#ЕСЛИ КЛИЕНТ ТОГДА

// Процедура формирования печатной формы отчета
//
Процедура ОбновитьОтчет(ТабДокумент) Экспорт

    Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Предупреждение("Не указана организация");
		Возврат;
	КонецЕсли;
    Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Предупреждение("Не указан склад");
		Возврат;
	КонецЕсли;
	
	ТабДокумент.Очистить();
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегПартииТоваров.Номенклатура,
		|	РегПартииТоваров.Номенклатура.Код КАК Код,
		|	ПРЕДСТАВЛЕНИЕ(РегПартииТоваров.Номенклатура) КАК ПечНоменклатура,
		|	РегПартииТоваров.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдИзм,
		|	РегПартииТоваров.Номенклатура.ЕдиницаХраненияОстатков.Код КАК ПечКодЕдИзм,
		|	ПРЕДСТАВЛЕНИЕ(РегПартииТоваров.Номенклатура.ЕдиницаХраненияОстатков) КАК ПечЕдИзм,
		|	СУММА(РегПартииТоваров.КолОст1) КАК КолОст1,
		|	СУММА(РегПартииТоваров.КолОст2) КАК КолОст2,
		|	СУММА(РегПартииТоваров.КолОст3) КАК КолОст3,
		|	СУММА(РегПартииТоваров.СумОст1) КАК СумОст1,
		|	СУММА(РегПартииТоваров.СумОст2) КАК СумОст2,
		|	СУММА(РегПартииТоваров.СумОст3) КАК СумОст3
		|ИЗ
		|	(ВЫБРАТЬ
		|		РегТовары.Номенклатура КАК Номенклатура,
		|		РегТовары.КоличествоОстаток КАК КолОст1,
		|		0 КАК КолОст2,
		|		0 КАК КолОст3,
		|		РегТовары.СтоимостьОстаток КАК СумОст1,
		|		0 КАК СумОст2,
		|		0 КАК СумОст3
		|	ИЗ
		|		РегистрНакопления.ПартииТоваровНаСкладахБухгалтерскийУчет.Остатки(
		|			&КонГраница,
		|			Организация = &Орг
		|			    И Склад = &Склад) КАК РегТовары
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РегТовары.Номенклатура,
		|		0,
		|		РегТовары.КоличествоОстаток,
		|		0,
		|		0,
		|		РегТовары.СтоимостьОстаток,
		|		0
		|	ИЗ
		|		РегистрНакопления.ПартииТоваровНаСкладахБухгалтерскийУчет.Остатки(
		|			&КонГраница,
		|			Организация = &Орг
		|			    И Склад = &Склад) КАК РегТовары
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РегТовары.Номенклатура,
		|		0,
		|		0,
		|		РегТовары.КоличествоОстаток,
		|		0,
		|		0,
		|		РегТовары.СтоимостьОстаток
		|	ИЗ
		|		РегистрНакопления.ПартииТоваровНаСкладахБухгалтерскийУчет.Остатки(
		|			&КонГраница,
		|			Организация = &Орг
		|			    И Склад = &Склад) КАК РегТовары) КАК РегПартииТоваров
		|
		|СГРУППИРОВАТЬ ПО
		|	РегПартииТоваров.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	РегПартииТоваров.Номенклатура.Наименование
		|ИТОГИ
		|	СУММА(КолОст1),
		|	СУММА(КолОст2),
		|	СУММА(КолОст3),
		|	СУММА(СумОст1),
		|	СУММА(СумОст2),
		|	СУММА(СумОст3)
		|ПО
		|	ОБЩИЕ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр( "КонГраница", Новый Граница(КонецДня(КонДата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр( "Орг",        Организация);
	Запрос.УстановитьПараметр( "Склад",      Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Макет = ПолучитьМакет("МХ19");
	Область = Макет.ПолучитьОбласть("ПервыйЛист");
	
	ИнфоОрг = РегламентированнаяОтчетность.ПолучитьСведенияОбОрганизации(Организация, КонДата, "ОКПО");
	
	// Вывод заголовка
	Область.Параметры.Организация     = Организация;
	Область.Параметры.ПечОрганизация  = Строка(Организация);
	Область.Параметры.ПечКодОКПО      = ИнфоОрг.ОКПО;
	Область.Параметры.ПечДата  = КонДата;
	Область.Параметры.Склад    = Склад;
	Область.Параметры.ПечСклад = Строка(Склад);
	
	ТабДокумент.Вывести(Область);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Вывод шапки таблицы
	ОбластьТабШапка = Макет.ПолучитьОбласть("ТабШапка");
	ОбластьТабШапка.Параметры.Дата1 = """" + Формат(ПериодС,  "DF=dd") + """ " + Формат(ПериодС,  "DF=MMM.yyyy");
	ОбластьТабШапка.Параметры.Дата2 = """" + Формат(ПериодПо, "DF=dd") + """ " + Формат(ПериодПо, "DF=MMM.yyyy");
	ОбластьТабШапка.Параметры.Дата3 = """" + Формат(КонДата,  "DF=dd") + """ " + Формат(КонДата,  "DF=MMM.yyyy");
	
	ТабДокумент.Вывести(ОбластьТабШапка);
	
	// Вывод табличной части
	Область = Макет.ПолучитьОбласть("ТабСтрока");
	ТабДокумент.Вывести(Область);
	
	МассивОбластей = Новый Массив;
	МассивОбластей.Добавить(Область);
	МассивОбластей.Добавить(Макет.ПолучитьОбласть("ТабИтог"));
	МассивОбластей.Добавить(Макет.ПолучитьОбласть("Подвал"));
	
	ОбходИтого = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ОбходИтого.Следующий() Тогда
	
		Обход = ОбходИтого.Выбрать();
		НомПП = 0;
		Пока Обход.Следующий() Цикл
			НомПП = НомПП + 1;
			
			Область.Параметры.ПечНомПП        = Строка(НомПП);
			Область.Параметры.ПечНоменклатура = Обход.ПечНоменклатура;
			Область.Параметры.Номенклатура    = Обход.Номенклатура;
			Область.Параметры.ПечКод          = Обход.Код;
			Область.Параметры.ПечЕдИзм        = Обход.ПечЕдИзм;
			Область.Параметры.ЕдИзм           = Обход.ЕдИзм;
			Область.Параметры.ПечКодЕдизм     = Обход.ПечКодЕдизм;
			Область.Параметры.КолОст1 = Обход.КолОст1;
			Область.Параметры.КолОст2 = Обход.КолОст2;
			Область.Параметры.КолОст3 = Обход.КолОст3;
			Область.Параметры.СумОст1 = Обход.СумОст1;
			Область.Параметры.СумОст2 = Обход.СумОст2;
			Область.Параметры.СумОст3 = Обход.СумОст3;
			
			Если НЕ ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДокумент, МассивОбластей) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьТабШапка);
			КонецЕсли;
			ТабДокумент.Вывести(Область);
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("ПустТаб");
		Пока ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДокумент, МассивОбластей, Ложь) Цикл
			ТабДокумент.Вывести(Область);
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("ТабИтог");
		Область.Параметры.КолОст1 = ОбходИтого.КолОст1;
		Область.Параметры.КолОст2 = ОбходИтого.КолОст2;
		Область.Параметры.КолОст3 = ОбходИтого.КолОст3;
		Область.Параметры.СумОст1 = ОбходИтого.СумОст1;
		Область.Параметры.СумОст2 = ОбходИтого.СумОст2;
		Область.Параметры.СумОст3 = ОбходИтого.СумОст3;
		
		ТабДокумент.Вывести(Область);
		
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(Область);
	
КонецПроцедуры // ОбновитьОтчет()

#КОНЕЦЕСЛИ
